RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/utilities/str/fsl_str.c
    switch (flag & (uint32_t)kSCANF_LengthMask)
    {
        case (uint32_t)kSCANF_LengthChar:
            if (0U != (flag & (uint32_t)kSCANF_TypeSinged))
            {
                *va_arg(*args_ptr, signed char *) = (signed char)val;
            }
            else
            {
                *va_arg(*args_ptr, unsigned char *) = (unsigned char)val;
            }
            break;
        case (uint32_t)kSCANF_LengthShortInt:
            if (0U != (flag & (uint32_t)kSCANF_TypeSinged))
            {
                *va_arg(*args_ptr, signed short *) = (signed short)val;
            }
            else
            {
                *va_arg(*args_ptr, unsigned short *) = (unsigned short)val;
            }
            break;
        case (uint32_t)kSCANF_LengthLongInt:
            if (0U != (flag & (uint32_t)kSCANF_TypeSinged))
            {
                *va_arg(*args_ptr, signed long int *) = (signed long int)val;
            }
            else
            {
                *va_arg(*args_ptr, unsigned long int *) = (unsigned long int)val;
            }
            break;
        case (uint32_t)kSCANF_LengthLongLongInt:
            if (0U != (flag & (uint32_t)kSCANF_TypeSinged))
            {
                *va_arg(*args_ptr, signed long long int *) = (signed long long int)val;
            }
            else
            {
                *va_arg(*args_ptr, unsigned long long int *) = (unsigned long long int)val;
            }
            break;
        default:
            /* The default type is the type int. */
            if (0U != (flag & (uint32_t)kSCANF_TypeSinged))
            {
                *va_arg(*args_ptr, signed int *) = (signed int)val;
            }
            else
            {
                *va_arg(*args_ptr, unsigned int *) = (unsigned int)val;
            }
            break;
    }
#else
    /* The default type is the type int. */
    if (0U != (flag & (uint32_t)kSCANF_TypeSinged))
    {
        *va_arg(*args_ptr, signed int *) = (signed int)val;
    }
    else
    {
        *va_arg(*args_ptr, unsigned int *) = (unsigned int)val;
    }
#endif /* SCANF_ADVANCED_ENABLE */

    return 1U;
}

#if (defined(SCANF_FLOAT_ENABLE) && (SCANF_FLOAT_ENABLE > 0U))
static uint8_t StrFormatScanFillFloat(uint32_t flag, va_list *args_ptr, double fnum)
{
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
    if (0U != (flag & (uint32_t)kSCANF_Suppress))
    {
        return 0U;
    }
    else
#endif /* SCANF_ADVANCED_ENABLE */
    {
        if (0U != (flag & (uint32_t)kSCANF_LengthLongLongDouble))
        {
            *va_arg(*args_ptr, double *) = fnum;
        }
        else
        {
            *va_arg(*args_ptr, float *) = (float)fnum;
        }
        return 1U;
    }
}
#endif /* SCANF_FLOAT_ENABLE */

#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
static uint8_t strFormatScanfHandleh(uint8_t exitPending, char **c, uint32_t *flag)
{
    if (0U != ((*flag) & (uint32_t)kSCANF_LengthMask))
    {
        /* Match failure. */
        exitPending = 1U;
    }
    else
    {
        if ((*c)[1] == 'h')
        {
            (*flag) |= (uint32_t)kSCANF_LengthChar;
            *c = *c + 1U;
        }
        else
        {
            (*flag) |= (uint32_t)kSCANF_LengthShortInt;
        }
    }

    return exitPending;
}

static uint8_t strFormatScanfHandlel(uint8_t exitPending, char **c, uint32_t *flag)
{
    if (0U != ((*flag) & (uint32_t)kSCANF_LengthMask))
    {
        /* Match failure. */
        exitPending = 1U;
    }
    else
    {
        if ((*c)[1] == 'l')
        {
            (*flag) |= (uint32_t)kSCANF_LengthLongLongInt;
            *c = *c + 1U;
        }
        else
        {
            (*flag) |= (uint32_t)kSCANF_LengthLongInt;
        }
    }

    return exitPending;
}
#endif

static uint8_t StrFormatScanfStringHandling(char **str, uint32_t *flag, uint32_t *field_width, uint8_t *base)
{
    uint8_t exitPending = 0U;
    char *c             = *str;

    /* Loop to get full conversion specification. */
    while (('\0' != (*c)) && (0U == (*flag & (uint32_t)kSCANF_DestMask)))
    {
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
        if ('*' == (*c))
        {
            if (0U != ((*flag) & (uint32_t)kSCANF_Suppress))
            {
                /* Match failure. */
                exitPending = 1U;
            }
            else
            {
                (*flag) |= (uint32_t)kSCANF_Suppress;
            }
        }
        else if ('h' == (*c))
        {
            exitPending = strFormatScanfHandleh(exitPending, &c, flag);
        }
        else if ('l' == (*c))
        {
            exitPending = strFormatScanfHandlel(exitPending, &c, flag);
        }
        else
#endif /* SCANF_ADVANCED_ENABLE */
#if (defined(SCANF_FLOAT_ENABLE) && (SCANF_FLOAT_ENABLE > 0U))
            if ('L' == (*c))
        {
            if (0U != ((*flag) & (uint32_t)kSCANF_LengthMask))
            {
                /* Match failure. */
                exitPending = 1U;
            }
            else
            {
                (*flag) |= (uint32_t)kSCANF_LengthLongLongDouble;
            }
        }
        else
#endif /* SCANF_FLOAT_ENABLE */
            if (((*c) >= '0') && ((*c) <= '9'))
            {
                {
                    char *p;
                    errno          = 0;
                    (*field_width) = strtoul(c, &p, 10);
                    if (0 != errno)
                    {
                        *field_width = 0U;
                    }
                    c = p - 1;
                }
            }
            else if ('d' == (*c))
            {
                (*base) = 10U;
                (*flag) |= (uint32_t)kSCANF_TypeSinged;
                (*flag) |= (uint32_t)kSCANF_DestInt;
            }
            else if ('u' == (*c))
            {
                (*base) = 10U;
                (*flag) |= (uint32_t)kSCANF_DestInt;
            }
            else if ('o' == (*c))
            {
                (*base) = 8U;
                (*flag) |= (uint32_t)kSCANF_DestInt;
            }
            else if (('x' == (*c)))
            {
                (*base) = 16U;
                (*flag) |= (uint32_t)kSCANF_DestInt;
            }
            else if ('X' == (*c))
            {
                (*base) = 16U;
                (*flag) |= (uint32_t)kSCANF_DestInt;
            }
            else if ('i' == (*c))
            {
                (*base) = 0U;
                (*flag) |= (uint32_t)kSCANF_DestInt;
            }
#if (defined(SCANF_FLOAT_ENABLE) && (SCANF_FLOAT_ENABLE > 0U))
            else if (1U == StrFormatScanIsFloat(c))
            {
                (*flag) |= (uint32_t)kSCANF_DestFloat;
            }
#endif /* SCANF_FLOAT_ENABLE */
            else if ('c' == (*c))
            {
                (*flag) |= (uint32_t)kSCANF_DestChar;
                if (MAX_FIELD_WIDTH == (*field_width))
                {
                    (*field_width) = 1;
                }
            }
            else if ('s' == (*c))
            {
                (*flag) |= (uint32_t)kSCANF_DestString;
            }
            else
            {
                exitPending = 1U;
            }

        if (1U == exitPending)
        {
            break;
        }
        else
        {
            c++;
        }
    }
    *str = c;
    return exitPending;
}

static void StrFormatScanfHandleChar(
    const char **Cp, uint32_t *field_width, char **buf, uint32_t flag, uint32_t *n_decode, uint32_t *nassigned)
{
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
    uint8_t added = 0;
#endif
    while ((0U != ((*field_width)--))
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
           && ('\0' != (**Cp))
#endif
    )
    {
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
        if (0U != (flag & (uint32_t)kSCANF_Suppress))
        {
            (*Cp) = (*Cp) + 1U;
        }
        else
#endif
        {
            **buf  = **Cp;
            (*Cp)  = (*Cp) + 1U;
            (*buf) = (*buf) + 1U;

#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
            added = 1u;
#endif
        }
        *n_decode = *n_decode + 1U;
    }

#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
    if (1u == added)
#endif
    {
        *nassigned = *nassigned + 1U;
    }
}

static void StrFormatScanfHandleString(
    const char **Sp, uint32_t *field_width, char **buf, uint32_t flag, uint32_t *n_decode, uint32_t *nassigned)
{
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
    uint8_t added = 0;
#endif
    while ((0U != ((*field_width)--)) && (**Sp != '\0') && (0U == ScanIsWhiteSpace(**Sp)))
    {
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
        if (0U != (flag & (uint32_t)kSCANF_Suppress))
        {
            (*Sp) = (*Sp) + 1U;
        }
        else
#endif
        {
            **buf  = **Sp;
            (*buf) = (*buf) + 1U;
            (*Sp)  = (*Sp) + 1U;
#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
            added = 1u;
#endif
        }
        *n_decode = *n_decode + 1U;
    }

#if (defined(SCANF_ADVANCED_ENABLE) && (SCANF_ADVANCED_ENABLE > 0U))
    if (1u == added)
#endif
    {
        /* Add NULL to end of string. */
        **buf      = '\0';
        *nassigned = *nassigned + 1U;
    }
}

/*!
 * brief Converts an input line of ASCII characters based upon a provided
 * string format.
 *
 * param[in] line_ptr The input line of ASCII data.
 * param[in] format   Format first points to the format string.
 * param[in] args_ptr The list of parameters.
 *
 * return Number of input items converted and assigned.
 * retval IO_EOF When line_ptr is empty string "".
 */
int StrFormatScanf(const char *line_ptr, char *format, va_list args_ptr)
{
    uint8_t base;
    int8_t neg;
    /* Identifier for the format string. */
    char *c = format;
    char *buf;
    /* Flag telling the conversion specification. */
    uint32_t flag = 0;
    /* Filed width for the matching input streams. */
    uint32_t field_width;
    /* How many arguments are assigned except the suppress. */
    uint32_t nassigned = 0;
    /* How many characters are read from the input streams. */
    uint32_t n_decode = 0;

